app/Controllers/Profile.php

    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $userModel = new UserModel();
        $user = $userModel->find(session()->get('id'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '4'

    public function update()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        helper(['form', 'url']);
        $userModel = new UserModel();
        $userId = session()->get('id');
        $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '4'

            $data['profile_picture'] = $fileName;
        }

        $userModel->update($userId, $data);
---
UPDATE `users` SET `name` = 'ShubhamGoswami', `email` = 'abcd@gmail.com', `updated_at` = '2025-03-19 16:05:22'
WHERE `users`.`id` IN ('4')